
def area(a):
    '''
    Вычисляет площадь квадрата со стороной длины "a"

        Входные данные:
            double a : длина стороны квадрата
        
        Выходные данные:
            double area : площадь квадрата со стороной длины "a"
    '''
    return a * a


def perimeter(a):
    '''
    Вычисляет периметр квадрата со стороной длины "a"

        Входные данные:
            double a : длина стороны квадрата

        Выходные данные:
            double perimeter : периметр квадрата со стороной длины "a"
    '''
    return 4 * a
